Tekla Open API Reference for Tekla Structures 2025
AnalysisModelConnectivityRule.Group2 Property
 The group name 2 of the connectivity rule.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Group2 { get; set; }
Public Property Group2 As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnalysisModelConnectivityRule Class
Tekla.Structures.Analysis Namespace